Revit 2027 API
ParameterTypeId.RbsShowProfileType Property
 "Show Round"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsShowProfileType { get; }
Public Shared ReadOnly Property RbsShowProfileType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsShowProfileType {
	ForgeTypeId^ get ();
}
static member RbsShowProfileType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace